[{"text": "\n           \n           I refuse to write a review for one of the best books ever written. Asking a serious fantasy fan to write a review for Lord of the Rings is like asking a Christian to write a review for The Bible. So instead I will supply you with this graph:\n         ", "book": "The Fellowship of the Ring (The Lord of the Rings, #1)", "user": "Lyndz", "stars": "5", "date": "Jun 20, 12", "likes": "488"},
{"text": "\n           \n           This was a re-read for me, and it took me a lot less time to read it a second time around! I guess at the time the writing and length of the book was a bit too much for me in my younger teen years.I'm a massive fan of the  movie trilogy, particularly with  which I have seen countless times and can quote from off and on. What I enjoyed about reading this book was envisioning all the characters as my beloved movie counterparts. I know this will probably be somthing that annoys people who read the books first, but I have no issues with envisioning those actors as the characters in the book.The main thing I enjoyed in this book was the depth of detail in the back story. The chapter  was particularly enjoyable, as I loved hearing Gandalf tell Frodo the history of the ring and Middle-Earth, and it didn't drag for me at all. I also thoroughly enjoyed the chapters set in Moria, Rivendell (even the council, not as bad as I remember it being!), and particularly the end scene with Frodo and Boromir, and later Sam.I still have problems with this book, and they remain from my first reading. First of all, the story tends to drag in certain parts. Although J.R.R. Tolkien was talented at descriptions, I found that the constant scenes with the characters walking to various destinations to be dull and repetitive. The constant depictions of walking and stopping and looking at the trees and hills etc. became quite trying after a while. My other pet peeve is the character of Tom Bombadil - I am firmly in the camp of people who  him. In the first chapter where he appeared, it took me probably around 3 times as long to read it as it took me to read the Council scene. I have never understood the point in having him included, and found my eyes glazing over and staring into space at numerous points within the chapter.I'm looking forward to seeing how I find  on a re-read as well, but I have to say that so far I prefer the films and fully back the alterations they made. That might be just because I was a film fan first, but I stand by my opinion.\n         ", "book": "The Fellowship of the Ring", "user": "Vanessa", "stars": "3", "date": "Oct 01, 15", "likes": "16"},
{"text": "\n           \n           Well, that took me way too bloody long. It's an amazing world that Tolkien has created. The fantastical creatures, Middle Earth, all the places and languages and songs. That must have taken forever to come up with, or maybe he was just a genius. Either way, I'm gonna be a blasphemist here and say I prefer the movie. The book felt too long-winded and not as enticing as the movie. The characters stayed two-dimensional and most of them were not that different from one another. The story went on too long and the songs started driving me nuts after a while. Honestly, it was a job trying to finish this. And reading shouldn't be a job. Unless you have a really cool job, in which case I envy you.I gotta say, Aragorn is a lot more fun to watch than to read about.\n         ", "book": "The Fellowship of the Ring (The Lord of the Rings, #1)", "user": "Inge", "stars": "2", "date": "Oct 30, 13", "likes": "17"},
{"text": "\n           \n           5.0 stars. I just re-read this book as it has been a LONG time since I first read it and was curious about how well it would hold up over time. The answer is... AMAZINGLY WELL. I was actually a bit surprised at just how good this book is as it is very easy to be disappointed when you read the \"consensus\" standard of any genre. Well this series not only IS the standard, but it DESERVES to be the standard of epic fantasy. I am looking forward to re-reading the next two books in the trilogy. \n         ", "book": "The Fellowship of the Ring (The Lord of the Rings, #1)", "user": "Stephen", "stars": "5", "date": "Oct 21, 08", "likes": "19"},
{"text": "\n           \n           NOTA: Hay algo que quiero expresar antes de dar mi opinión sobre el libro: Esa quote la AME! No creo que la mayoría entienda el significado de esas lineas. Verán, la pregunta ¿Porque Dios deja que estas cosas pasen? es muy común, no creo que pueda ser explicado de una mejor manera que con esas sabias palabras del maestro Tolkien, lo que decidamos crear, bueno o malo, tendrá consecuencias a toda la humanidad y si estas son problemas, las soluciones también tendremos que crearlas nosotros. NADA ni NADIE va a bajar a solucionar nada, queremos libertad en el mundo que habitamos? bien pues, hay que pensar antes de actuar.Ame este libro, es aventura en el mas puro sentido de la palabra. Te enseña sobre el valor, coraje, lucha, entrega, amistad, lealtad, unión, esperanza...La escritura es perfecta y fácil, para algunos puede que sea tediosa pero creo que es porque brincar del genero YA al genero de ADULT no es fácil, pero luego de unas paginas te acostumbras. Las descripciones son fantásticas,  Y cuando se cuenta sobre el pasado de esta, o lo que paso en otras edades solo me hace querer releer el Silmarilion otra vez! Los personajes son variados, entretenidos y auténticos. Y la historia no esta nada forzada.  Todos tenemos algo que hacer, hay que dejar de darle vueltas a las cosas y enfrentar nuestro destino.Muy pocos son capaces de crear e imaginar un mundo tan completo, entre esa poca gente, J.R.R Tolkien. Osea, el hombre invento un idioma por Dios!Dale una oportunidad, que no se quede en las películas, te aseguro que te llevaras una sorpresa.PD: Legolas, Elrond y Gandalf!!!! los amo y ya.\n         ", "book": "La Comunidad del Anillo (The Lord of the Rings, #1)", "user": "Denisse", "stars": "5", "date": "Feb 18, 15", "likes": "21"},
{"text": "\n           \n           واقعا اونقدر جدی درمورد اسناد و .. صحبت میشه که از خودم خجالت میکشدم موقع خوندن که این رو جزو فانتزی ها میدونستم :)) :-\"وای... الف ها... الف ها... علاقه ی من به این موجودات حقیقتا غیرقابل وصفه!!! و تا مدت زیادی بعد از دیدن فیلم هاش من موهام رو سعی میکردم مثل لگولاس ببندم :\">وای آخه چقدر دوستداستنی؟ آواز میخونن، چنگ میزنن، قدیمی ن، همراه طبیعتن، زیبان، و ... آه...پ.ن: همراه با مریم خوندم، و با اینکه اون خائن (!) کلی از من عقب بود، یهو یه روز زود تر تموم کرد :-الپ.ن 2: تا 9 روز دیگه که لیلی رو میبینم مجبورم صبر کنم برای خوندن دو :-<پ.ن 3: واقعا ستاره ای جز پنج به نظرم نمیرسه :د\n         ", "book": "یاران حلقه", "user": "Rana Heshmati", "stars": "5", "date": "Jul 10, 15", "likes": "17"},
{"text": "\n           \n           I dalje me oduševljava kao i prvi put!!!10*\n         ", "book": "Družina prstena (Gospodar prstenova, #1)", "user": "Frogy", "stars": "5", "date": "Aug 14, 15", "likes": "18"},
{"text": "\n           \n           I'm not even going to start talking about how much I bloody love this book and how amazing it is. \n         ", "book": "The Fellowship of the Ring (The Lord of the Rings, #1)", "user": "Lady Bilbo (Nicole)", "stars": "5", "date": "Sep 18, 14", "likes": "22"},
{"text": "\n           \n           I first read this book after stumbling upon my father's copy. I hadn't enjoyed it (at the time, Tolkien seemed a little too long-winded for my taste); however, when five years later I requested the full set of Harry Potter novels (whatever had been out at the time), my Mother bypassed Rowling and bought my a full set of Tolkien instead... and I have been in love ever since.I once read a quote about J.R.R. Tolkien, which asked increduously: \"How did one man, in the course of a single lifetime, become the literary equivalent of a people?\" I very much took that to heart: the extensive research, love for archaic word-forms and languages, the spell-weaving of this master novelist are without equal. Yes, the book can be difficult, obtuse and thick at the beginning, but I prefer to think of it as a mining project: you must first get throught the hard layers before you can find a single diamond. And I assure you, there are masses of diamonds in this trilogy.\n         ", "book": "The Fellowship of the Ring (The Lord of the Rings, #1)", "user": "Jessica", "stars": "5", "date": "Jul 15, 07", "likes": "26"},
{"text": "\n           \n           I know crazy that I have only just read this for the first time! I am not going to do much of review because everyone knows what this book is about and how great and foundational it is to the fantasy genre. I will say it is one of the very few instances that j saw the movies before reading the novels! With that being said, why would the movie leave out Tom bombadil!! Easily my favourite character. Anyway some will notice the 4 stars and wonder why. I know that most people might disagree with me on that ranking which is fine. But I just found it was TOO descriptive, I would be lying if I said it didn't effect my read. I understand the beauty and elegance of his writing and his thoroughness of the content, but for me it kind of dragged the read on a tad. I don't want to be the type to give a 5 based on name only, so I won't. But I mean come on its LOTR it is still an amazing read! \n         ", "book": "The Fellowship of the Ring (The Lord of the Rings, #1)", "user": "Jeff", "stars": "4", "date": "Apr 19, 15", "likes": "29"},
{"text": "\n           \n           Creo que su alguien menciona la palabra  lo primero que se nos viene a la cabeza es Tolkien. Así que no sé qué podría decir de este libro. Pienso que todos saben lo que significa este autor para el género y la literatura. La Comunidad del Anillo es el inicio de una increíble joya (aunque, para mí, comienza con El Hobbit). No se me hizo muy pesado; reconozco que en algunas partes llegue a pensar: , pero no son muchas. Me mantuvo pegado a la historia como chicle a la mesa. \n         ", "book": "La Comunidad del Anillo (El Señor de los Anillos, #1)", "user": "Franco  Santos", "stars": "5", "date": "Jan 18, 15", "likes": "29"},
{"text": "\n           \n           This is a world of wonder that Mr. Tolkien created more than 60 years ago and it leaves me at a loss for words to think he created something that then was considered to be 'nothing at all' but now still continues to inspire thousands and thousands of authors to begin their own epic fantasy series set in a world like this. J.R.R. Tolkien was innovative without ever realising it. This is just fun, fun, fun. Fun to read. Fun to create the image in your head where imagination runs wild. I loved reading about Frodo & Sam and how it all began. I loved reading about Bilbo and his family. I loved getting to know Pippin & Merry & Gandalf & Aragorn & Legolas & Gimli. About the One Ring & how they set out into the adventure that would change their lifes.The prose is one of the most stunning writings I've ever had the luck of reading. It is such a well-written book and it makes sense why it took him so long to write this, after . He wanted to make this as much detailed as possible. And he did it.I couldn't omit to mention this in my review:\n         ", "book": "The Fellowship of the Ring (The Lord of the Rings, #1)", "user": "Laz", "stars": "5", "date": "Jan 28, 15", "likes": "29"},
{"text": "\n           \n           No debate: This is Tolkien created a whole new world called Middle-earth. When Peter Jackson's movie adaptation came out in 2001, I thought that Middle-earth was some kind of an ancient city that was submerged somewhere beneath the earth just like Atlantis was a fictional city in the bottom of the sea. Well, that was before I attempted to read this book. When that movie came out in 2001, I bought a copy of the book with Elijah Wood on the cover but I did not get past page 50. I found it too archaic. So I just watched all the movies and applauded Peter Jackson and his gang when they went up the stage during the Oscars. In 2009, when I started my 1001 Book quest, I tried picking up that same edition again but I again did not last beyong page 50.Until I got this edition last month: LARGE PRINT PRESS for only P99 (US$2). I did not know that small prints can turn the book into archaic. Try reading this edition and I am sure that this book, which some of my Goodreads friends say as not a children's book, a joy and easy to read just like the Harry Potter series.What is it about British authors? There was LOTR in 1950's and HP in the 1990's. They seem to have the ability to create new fictional worlds - Middle-earth and Hogwart's respectively - beyond many writers' imagination. Try checking any of the Best Ever Books list and you will surely see these two. Well, because of being seen already as a classic, LOTR appears more than HP but wait for more decades.I read  last month and I liked it but I enjoyed this first part of LOTR more. The Hobbit is truly light compared to the darker \"Fellowship.\" I think the darker shade is due to the added characters and the fact that the story behind the ring has been put into the open. It is also in this reading that I realized that the evil Sauron is the actually the title of this book. The big villain boss being the banner header of this epic monumental book. How about that for a change huh?Above all, the message of friendship, love and personal sacrifice is what I liked about this book. Frodo and Sam. The members of the fellowship. Frodo leaving the fellowship as he thinks the quest of returning the ring will be easier if he does it alone. I am looking forward to the rest of this trilogy. Must read soon!\n         ", "book": "The Fellowship of the Ring (The Lord of the Rings, #1)", "user": "K.D. Absolutely", "stars": "5", "date": "Jan 28, 11", "likes": "38"},
{"text": "\n           \n           You know how they sayThat'sThe Fellowship of the Ring is proof of that! It takes the rule of show-don't-tell and flushes it down the toilet, because who would rather experience all the kick-ass action scenes themselves when they could just hear someone discussing them over dinner tables like they were discussing rice vs. potatoes? Pffft, no one ofc.... Right?I mean, who likes action anyway. Why don't we just drop all the action in general and add pages of pages of scenery descriptions instead?Hearing about the gorgeous colors of the trees is so much more fun than hearing about how PEOPLE ALMOST GET KILLED BY HORRIBLE CREATURES OF EVIL TRYING TO DESTROY THE WORLD AND RUIN ALL THINGS GOOD!I'd say go watch the movie.\n         ", "book": "The Fellowship of the Ring", "user": "Emily", "stars": "3", "date": "Apr 03, 14", "likes": "35"},
{"text": "\n           \n           Tonight on Anderson Cooper 360, we find ourselves in Murfreesboro, Tennessee and at The Green Dragon Public House, a Tolkien inspired pub. Our special guest tonight is none other than THE Hobbit, Mr. Bilbo Baggins, formerly of the Shire. We’ll have a moment to get to know the individual that has meant so much to generations of literary fans and then to a new generation of movie going fans in this last decade. Bilbo, how are you tonight?Bilbo Baggins: I’m well; thank you, Anderson, and how about yourself?Anderson Cooper: I’m fine, thanks. Tell me, what was it like working with Peter Jackson?BB: What’s not to like? He’s a consummate professional, with great attention to detail and a heart for our story.AC: How was he different than working with J.R.R Tolkien?BB: Ronald was a wonder, a finer man this world has ever known. He was sensitive, but not in the way this generation uses the term; he was a real man, he could chop wood and build a fire, but he had in mind the celestial, he was a Godly man. Peter is more worldly, but spiritual in his own way.AC: Was Hollywood different than England in the 1950s?BB: My word, yes! But mostly in the scale of things, not so much the substance. When Ronald first published our story in your time of 1954, there was some fuss and attention but nowadays there is another level of fame and fortune altogether, I cannot wrap my mind around it! I wanted to pay for a breakfast of some eggs and sausages and the innkeeper said, “your money is no good here, Master Hobbit” but I’ve never had so much coin as I have now and no one will take it! The world has gone topsy-turvy.AC: And your nemesis, Sauron, how has he changed over the years?BB: Well! Now there is a query, yes sir! Let me just say that he was a pain the arse in the distant past and remains so today. His kind will always be a ticklish spot on the mattress if you get my meaning; I was not at all surprised to see him get involved with your politics.AC: What about that, Bilbo – is it alright if I call you Bilbo?BB: Please do.AC: Thank you, what about Sauron’s entry into local politics?BB: Let me speak candidly, Anderson, Sauron is a self-serving lot. His foray into your politics is all about what is best for him.AC: Were you surprised that he has adapted so well to our political climate?BB: Not at all! Oh my goodness, no! He was made for the arena, as your Mr. Nixon would say.AC: Bilbo, has fame changed you at all?BB: Anderson, I’d like to think not, but maybe in some small ways.AC: Example.BB: Fair enough, I like to get the top of my feet waxed. Back in the Shire, forget about it, but around here, it’s just a matter of getting it done and who to do it.AC: The top of you feet waxed?BB: A mild vanity, I assure you, a simple pleasure for me to preen and pleasure.AC: Well deserved, I’m sure.BB: Well, there are the simple ways to be enjoyed.AC: Bilbo, what would you like to convey to our audience before we sign off?BB: Thank you, Anderson. I’d just like to say to our audience, to our fans, both of the books and the more recent films, I think our story is about decency and doing what is right. It’s not always about slaying dragons or defeating an evil tyrant – more often it is the small things – paying a fair wage to your gardener or the village grocer, and observing the common courtesies. If we can win the small battles at home, then the larger wars will take care of themselves.AC: Thank you, Bilbo, it has been a pleasure.BB: The pleasure is all mine, Anderson, and won’t you enjoy some fine craft ales while we’re here?AC: Why not? Thanks again to Mr. Bilbo Baggins, this is Anderson Cooper reporting from Murfreesboro, Tennessee with the Hobbit, Bilbo Baggins. Take care, America.2015 reread: My first impressions after rereading this wonderful story is that at its heart it is a travel book, from the departure from the Shire , through Bree, and all the way along the dangerous paths, down through Moria and visiting Lorien this is a story about a journey.This also made me even more appreciate the fine work of director Peter Jackson and his crew for a magnificent job filming Tolkien’s great vision. However, I do miss the exclusion of Tom Bombadil from the films as he is a testament to how, as good as the films are, lacking they are when it comes to the fullness of Tolkien’s story, the films are martial and about armed conflict. Jackson must sell tickets, I understand that. But Bombadil, poetry and song are also an integral part of Tolkien’s Lord of the Rings and part of this template for high fantasy.One thing Jackson got right was the importance of Sam Gamgee, his simple straightforward approach to life perhaps mirrored Tolkien’s own English countryside manner.Finally, the scene between Boromir and Frodo is classic in literature. Well done, Professor Tolkien.\n         ", "book": "The Fellowship of the Ring (The Lord of the Rings, #1)", "user": "Lyn", "stars": "4", "date": "Aug 12, 15", "likes": "40"},
{"text": "\n           \n           Do you have an old, worn piece of clothing? Perhaps that sweat shirt that you can’t wear anywhere except to bed or walking your dog? Perhaps it is an old blanket, a pair of shoes, maybe it’s a stuff animal. Regardless of what it is, every time you touch it or smell it, you feel peace, warmth, or perhaps, even home.Know what I’m talking about? Good, that’s how  feels to me. I don’t how many times I’ve read the trilogy itself, let alone each book. I do know that I had to buy another edition after I wore out my first. (Technically, if you count my borrowing my mother’s copies when I was kid, I’ve had three editions). To me the whole story is like that worn out piece of clothing. starts with this book . Even today, after I must have read the series at least twenty times, I opened the book, and I’m there. I’m in Middle Earth with Frodo and crew.This is strange because I know, on an intellectual level, that LOTR is not a perfect book or series. In fact, all the flaws are on heavy display in this first part. It’s true, that the story does meander. That the pacing at times is slow. It is also true that Terry Pratchett is correct when he says if you believe the LOTR is the best written book ever, you haven’t read enough (I’m paraphrasing that).And yet, it is one of three works I return to year after year.Because it is the !At the very least, if you like fantasy literature, you should attempt to read this. Regardless of how one feels about Tolkien’s style, he is highly influential in fantasy literature. Some writers, such as Brooks and McKiernan, have “ripped off” the series. Other writers, such as Tad Williams and Marion Zimmer Bradley, have written in reaction to him.But influence doesn’t explain entirely the attraction of this work. And this is supposed to be a review of , so I best start (and finish at this point) with it. sets the stage and is told in two parts. The first part of the book deals with the flight of Frodo and his friends to Rivendell. The second tells the story of the Nine Walkers as they set out to destroy the one Ring, a device of evil, a power that corrupts. The destruction of the Ring will stop the Dark Lord (No, not Voldemort. This is where Rowling got the idea), and save the land of Middle EarthThe heart of the story, the bulk of this book, is the friendship and courage of the Hobbits. It is the Hobbits that in many ways allow the reader access to the story. There is a very simple reason why.Hobbits are normal. True, they are normal in a big hairy feet kind of a way, but they are far closer to those of us in the real world then elves, dwarfs, wizards, or even, the men that inhabit Middle Earth.It is from Tolkien that most fantasy derives its treatment of elves. In  the reader is introduced to a great many elves (most of who seem to have names starting with the later G). The reader is told a great many things about elves, like the fact that they can run on top of snow and have good eyesight, as well as living forever. Dwarves too have they strangeness, being long lived and short. Even the men, such as Strider and Boromir are different. Boromir is far closer to your everyday human than Strider, who lives long and has a rather interesting family tree. But even Boromir isn’t quite real.The Hobbits, despite their age and hairy feet, are. Frodo, Merry, Pippin, and Samwise are all templates of people the reader might know. I watched Errol Flynn’s  at an extremely young age. Therefore, any being that uses a bow is the most awesome creature ever. I like elves. I could marry Legolas, even in his Orlando Bloom incarnation. Yet, I identify more with the Hobbits because they are not warriors. Because, outside of Frodo, they go on the quest for friendship. Not for glory or because the quest is the right thing to do, but because the quest is the right thing to do because of their friendship with Frodo. That is something wonderful. Too often in modern novels the quest is undertaken for an encompassing reason, a save the earth reason. And this is true of everyone who takes it up (outside of the odd twit who goes to get the guy to notice her), but Sam, Merry, and Pippin do it out of loyalty. A friend is in trouble and they want to help. It is this desire, this trait that makes people human. It is one of our most basic instincts, and it is not a bad one.The Hobbits are also attractive because they are little people in a big world and who doesn’t feel like that sometimes? Unlike , the superior tone of the narrator is not present. The Hobbits could quite easily be overwhelmed by what they encounter, but they are not. They plug away and keep going. There is something human about that. Not a Cunclucian against the waves type of feel, but a life feeling that one does get from the other characters. They are the everyday people in the quest. The everyday solider in the war.It is also important to remember that  is in the tradition of a saga. While  seems to be designed to be read aloud,  seems to beg to be told over a fire with a tankard of ale in hand. The style resembles that of the Old Norse sagas and tales that Tolkien draws upon. There is no large of amount of hand wringing, or deep discussions of feelings. It is a quest, and it reads like one. While it is not necessary to have read these old sagas before starting , it does help, at least for older readers, to keep in mind this influence. Like the Old Norse legends, Tolkien seems to be dealing with the concept of Raganork. While the quest is one to save Middle Earth, it is also a quest with a coast. As the reader reads the book, sentences appear about how so and so will never be in X again. There is the leave taking of the elves. The idea seems not only to be the coming of the Age of Men, but also the presentation of a quieter, gentler end of the world. In some ways,  prepares the reader for death in all its raiment’s.Despite this fading, the world seems real. Not only do the Hobbits, Strider, and Gimli believe in their world, but so does Tolkien, and he paints it so that the reader sees it as well. It is true that the beginning of  is little more than a description of Hobbits, but after this, Tolkien world builds and does it extremely well. There are references that the characters know, but the reader doesn’t. Yet, this is done in such a way that the reader doesn’t feel stupid or left out. It is done as it would occur in reality. There is much to be said for this level of description. It’s more than Tolkien’s world building. In parts of the book there are wonderful sentences that convey want, loss, truth, and love – all in one sentence. Not only that, but in a sentence that works wonderfully well, that doesn’t bang itself over the head of the reader.It’s also true that in this book, there are not many women. In fact, there are two. And one of them doesn’t say anything. But the one who does. Galadriel rocks! And she has more than one of those wonderful sentences.The overwhelming theme of  is, in fact, Fellowship. At the heart of this book is a wonderful portrait of friendship and sacrifice that moves the reader. It is a rebuke against the idea of a man or a people as an island.Amended 12/7/12 - Butterburr is the best barkeep!\n         ", "book": "The Fellowship of the Ring (The Lord of the Rings, #1) ", "user": "Chris", "stars": "5", "date": "Mar 22, 15", "likes": "42"},
{"text": "\n           \n           I've read this series many, many times, though it's been years since the last time. There was a period between 2001 and 2008 in which this trilogy was in the rotation of several series that I would read again and again and again. So it's pretty safe to say that this was a favorite. But then in 2008 I joined Goodreads, and my reading habits have changed. I think about books differently, more critically, because now I review them all. And that has not been great news for this read through. I can still say that I love it. The world-building, the quest, the adventure, the characters - but mainly the story - they are all just so epic and engraved in my mind, and I can't NOT love them. But the actual reading of the book has not held up as well for me. The descriptions are very, very detailed, and there are so many of them, that the pacing is just slower than molasses. It takes ages to have a discussion to decide that a decision about leaving is needed, let alone actually doing anything. The first book of Fellowship (because it is separated that way) is very slow going, not as dangerous, not as dire. From the time that Gandalf is aware that the ring is THE RING, and that it is being sought, it takes MONTHS for Frodo to actually leave. Like, \"Oh, you know, no rush.\" But the second book starts getting more dangerous, and then they STILL take their sweet time about doing anything. Orcs are patrolling the shore? We better watch for that tomorrow. It'll be fine tonight, I'm sure. *sigh* I have watched the movies many times, and though there's a lot that is left out or changed, I think that one of the biggest things that they did better than the original is the pacing. The book is like \"What's the rush? We haven't even had second breakfast yet!\". The movie is all \"SHIT JUST GOT REAL. GTFO THE SHIRE, FRODO!\"Another thing that they got very right is the greater role of Arwen in Fellowship, and made clear the relationship between Arwen and Aragorn. It's in the book - though vaguely, and you have to know to look for it. Aragorn mentions a few times that his heart lies in Rivendell, and Galadriel actually passes along the token from Arwen to Aragorn - but if you don't know Arwen's geneology, you could literally blink and miss it. Compared to the detailed everything else, this is something of a disappointment. I love her expanded role in the movie. She actually is someone to admire and respect. She's badass, and fearless, and saves Frodo just in time. In the book, a male elf (Glorfindel) meets them on the road, and they WALK to Rivendell... Well, everyone but Frodo, who got to ride Glorfindel's horse while the rest walked. *yawn*And considering that Arwen is one of only four named female characters in the book (not counting those we meet only through lore and lay), it's even more disappointing for her character to be so shallow and slight in this book. It's clear, again, if you know what you're looking for, that Arwen is dear to Aragorn, and that she is part of the reason he fights - but the only thing that we know about her from the book is that she is beautiful, she's Elrond's daughter, and Galadriel's grand-daughter. There is more about her in the index and appendices, but it's disappointing to see so little of her in the story itself, especially considering how LONG we hung around Rivendell. The other three named female characters were Lobelia Sackville-Baggins, Goldberry (Tom Bombadil's wife), and Galadriel. Lobelia is a greedy, nasty woman. Goldberry is beautiful and loves to dance and sing, and is the River's daughter. And Galadriel is beautiful, wise, and powerful, but for good. She is by far the best developed, and most active, female character in Fellowship, but it's unfortunate that so much of her screen time, so to speak, goes to how lovely she is. One area I think that the movies do a disservice is in Frodo. The movies make him out to be much more of a wimp than he really is. He's definitely not a lion, but he's not nearly as mousy as he's portrayed in the movies either. He actually USES his sword in the book, not just dropping it everywhere and then standing around like a dumbass waiting to be attacked. He's definitely got more backbone in the book. He just takes a long time to get around to showing it. For the right kind of reader, this book will be everything they could dream of. Beautiful, detailed descriptions of lands and peoples and languages and skills and histories and lore, and presented in beautiful prose, and (I'm guessing) equally beautiful verse. I don't enjoy verse at all. In fact, I pretty much hate it. So all of the lays and songs and poems are completely lost on me. Because I'm the wrong type of reader for those things. I fully and willingly admit this. I skip the shit out of them, blasphemous as it may be. And yet, I still love this story. The story is what keeps me coming back, despite the slowness, the over-descriptiveness, the verse. The story, and the quest. It's exciting to me, and lovely, and it speaks to me. I don't come to see the trees, or the forest - I see all the stuff that lives inside it. I'm excited to crack open The Two Towers, because that's historically been my favorite of the series. So... here's hoping that I still love it as much as ever. :)\n         ", "book": "The Fellowship of the Ring (The Lord of the Rings, #1)", "user": "Becky", "stars": "4", "date": "Nov 23, 15", "likes": "41"},
{"text": "\n           \n           I consider  trilogy the best fantasy, and perhaps the best fiction, ever written. Middle Earth is a beautiful, rich, complete land to which Narnia pales by comparison (don't get me wrong, I very much like Narnia, too).The beginning of the quest, which starts innocently but dives into a much larger, darker world than its protagonist, Frodo Baggins, could have ever imagined, is absolutely spellbinding. A small portion of the near-infinite background is revealed and armed with a shallow knowledge of the lore of the One Ring, Frodo embarks on a mission deeper and more dangerous and impactful than he could ever possibly have fathomed.The depth and beauty of Tolkien's work stems from his obsession with language and how world events impact its evolution. To create this book and its wealth, Tolkien developed 14 complete languages, all of which can be learned and spoken, written, and read. He created the lore and legend that each population clung to for their heritage. The relationships, distrusts, friendships, and animosities between the races stem from ancient and powerful roots. The detail of the world before the series lends it a believability that is virtually unparalleled even in many nonfiction works.I've read this series 4 or 5 times, which is something I have not done with any other work, aside from formative Christian religious texts. No one book is complete without the other two, so I consider them all to be the same book, divided into several parts--so as to allow for the faint of heart to enter Middle Earth in safer, smaller pieces.\n         ", "book": "The Fellowship of the Ring (The Lord of the Rings, #1)", "user": "Bryce", "stars": "5", "date": "Oct 12, 07", "likes": "46"},
{"text": "\n           \n            There are some books that keep staring at you from you tbr of shame. Those books that everybody else has read but you. Yes, I'm talking about that Harry Potter book you skipped and only watched the movie, or that classic you had to read for school but just used sparknotes instead. The Lord of The Rings was that book for me. I felt like a fraud book worm until the day I finally read it. I've been trying to write a review for this book ever since I finished it but the truth isThis book is everything, everybody should read it at least once in their life. \n         ", "book": "The Fellowship of the Ring (The Lord of the Rings, #1)", "user": "Kimi", "stars": "4", "date": "Jul 24, 15", "likes": "28"},
{"text": "\n           \n           Read the review by Doc Opp; I think he covers it quite nicely. He explains how Tolkien was the forefather of fantasy writing, and why that makes his books important. He also shares his opinion that the historical importance sort of causes people to overlook that Tolkien couldn't write worth beans.Opp posits that perhaps it has something to do with the concept of heroism being different in Tolkien's days than it is now. I'm not sure I agree with that. I mean I agree that his characters are a study in perserverance without being able to really fight or do anything but perservere, I just don't know that I buy that it's a sign of the times. I think Tolkien was just boring.I don't disagree, also, that the Shannara series is essentially the same storyline with a better writer at the helm.My venom towards Tolkien is greater than Opp's perhaps because we read for different reasons. I have very little patience with writers who have great ideas or imaginations when it comes to the physical world, but can't get inside the head of a person to save their lives and thus can't tell a story. This sort of writer is often found in sci-fi/fantasy, because the genre is geared to reward the most innovative and plausible inventing of a future or past timescape.If guys like Opp were always doing the commentating I might not hate Tolkien with such a passion, but unfortunately the world is filled with people who don't read sci-fi but who recalled their lit teacher spoke Tolkien's name once and probably said something about how he was the father of modern fantasy, and those people went on to shout Tolkien's name from the rooftops to the extent that a movie even got made out of it. Now the movie I could actually stomach (a little) because Hollywood realized they couldn't completely bore the pants off of people and still make money. But I digress.I cannot conceive of any reason one would read these novels unless they were forced e.g. for a class. And even then, it'd better be a history class and not a writing class, unless the objective was to teach how not to write. There's no pace, no character development, the focus shifts between groups of characters ala Robert Jordan without any of Jordan's redeeming qualities (although Jordan certainly has faults as well).The most compelling reason to read these novels is so that you can rip someone a new one when they bring up Tolkien by making a point by point case where you describe all the things he does wrong.Let me put it this way, I have read some of the most God-awful books in my time. I mean when I was younger I would read a phone book if it was handy. But I could not finish the Fellowship of the Rings.Comparing Tolkien to Asimov is just...I mean that's like comparing me to Asimov. I have an imagination and so does Asimov, comparison ended. Asimov came up with a plausible future that was interesting, and then he wrote characters within that adventure that were compelling. Caves of Steel is brilliant because whatshisface the detective is sort of an everyman and Asimov deals with things such as embarrassment because your Dad's job doesn't rate you high enough to eat at the right hydroponics diner. I'm mangling things, but you get the point. Asimov may have been the best ever at having really cool ideas and not wasting them by forgetting to write about people.I hate Tolkien, I blame him for his vacuous and enraging fan base, I blame him for every author that followed him that spent 5 hours describing a blade of grass, I hate him for taking a genre that I like and making me want to vomit on it, even if he was the first. It makes me want to burn my entire fantasy bookshelf down to the ground.That's my review.\n         ", "book": "The Fellowship of the Ring (The Lord of the Rings, #1)", "user": "adam", "stars": "1", "date": "May 03, 07", "likes": "59"},
{"text": "\n           \n           How could you not rate this book 5 stars? :D\n         ", "book": "The Fellowship of the Ring (The Lord of the Rings, #1)", "user": "helen the bookowl", "stars": "5", "date": "May 09, 15", "likes": "33"},
{"text": "\n           \n           Tolkein's masterpiece is notable primarily for its historical significance. He basically invented the fantasy genre, and because of that all fantasy readers owe him a debt of gratitude. Many things in his books will seem somewhat cliche nowadays, but that's because they have been used so often since he wrote this book - almost all of them were original when this book was written.That said, Tolkein is not a terribly good writer. He tends to go on in excruciating detail about trivial concepts. Parts of the book, such as Ent poetry, are downright painful to read. And his leaf by leaf descriptions of forests can get fairly trivial. Since he wrote this series, several other fantasy writers have basically stolen the story and rewritten it with higher quality prose. Terry Brooks Shannara series, for example, is more or less identical in plot and characters, but Brooks is a notably better writer. So depending on whether you prefer the authentic text, or the better written text, you should choose accordingly. The notion of heroism in Tolkein is particularly worth noting. It is, so far as I can tell, the first set of novels that defines heroism entirely by internal features. The protagonist has no ability to fight, or to use magic, or basically do anything except to doing his best to do the right thing. This conception of heroism, which is what is what most people think of nowadays, is quite different than it was historically conceived (where heroism was synonymous with strength or ability, sometimes in conjunction with morality, but sometimes not). So, in this way, like so many others, Tolkein has had tremendous effect on popular culture.\n         ", "book": "The Fellowship of the Ring (The Lord of the Rings, #1)", "user": "Doc Opp", "stars": "3", "date": "Apr 29, 07", "likes": "90"},
{"text": "\n           \n           Give me a few friends,a stretch of pleasant hills and an ominous wood.Let us romp in the remnants of innocence,free of the fear coursing through the veins of the greater world.Give me the first half dozen chapters of  and I will gladly make a little heaven on earth out of it.After finishing  as a young boy, I needed something else, something a little more mature to meet my growing needs. Lucky for me, Tolkien had done just that in the form of his epic trilogy The Lord of the Rings. , the first book in the trilogy, is my favorite of the three. I fell in love with the four little friends striking out on their own, having adventures and misadventures that, within the context of the beginning of this first book, haven't yet taken on the worldly importance they will later on. My two favorite chapters are \"The Old Forest\" and \"Fog on the Barrow-Downs\" and it's probably because both contain a genuinely scary, Halloween-when-you-still-believe-in-boogiemen atmosphere. In fact, atmosphere is a particularly operative term here. Tolkien made me feel the suffocation of the ancient forest with it's mysterious gnarled trees. The ghosty fog upon the eerie downs evoked apparitions, the stuff of nightmare. The challenges and foes the four little hobbits face in these chapters are not on a grand scale - they're not even germane to the book's overall plot - but jeez louise, there's some scary-ass moments in there. Watching the boys handle these situations is just good, fun adventure material.Frodo, Sam, Merry, and Pippin skip along having a merry old time, stumbling into relatively minor troubles, all the while clueless that they possess the world's most powerful evil magic. I love that innocence. It reminds me of past days when my friends and I would grab stick-swords and hike through the woods, slashing at the trees that had become our goblin and ogre enemies. I could relate to the sense of foreboding Frodo and friends felt when finding themselves lost in a cold, eerie hallow with a creeping mist swirling about them. Growing up in the country, I knew exactly what it was like to run afoul of a truculent farmer and his vicious dogs. I could relate entirely to the first half of the first book, before the lords and wizards entered and it all became alien. Enjoyable as the journey to Mordor was, nothing could compare, no, nothing could even come close to touching my heart the way those first few chapters did.However, we must all eventually move on from the safety of home.  film version: I waited sooooo long for this. It was like waiting for the Red Sox to finally win the World Series. And when it finally happened, boy was it sweet! Back in the mid-to-late 90s I was working in Hollywood and so I would get the lowdown on what movies were in production and even pre-production. It must have been about '96 or '97 when I heard there was an interest in making a film version of . I promptly went SQUEEEEE!!! and wet myself. Then I heard Jackson was the one who'd potentially be directing it. My glee was tempered. I'd seen and much admired his haunting Heavenly Creatures, but I also new him as more of a Heavy Metal Magazine, comic gore, sci-fi kinda guy, and I feared such a person getting their sticky mitts all over my precious. But anyway, so now recall that this was '97ish and that the first installment didn't come out until 2001. That is a loooong time to wait for something you want in the worst way. I'd grown up watching  partially finished version and longed for a completed one. And now it was coming, but it was being delivered by an unreliable messenger. Tingling with mixed nerves, I sat in the theater waiting for Fellowship to begin, my heart still somber after 9/11. I wanted to feel good again. I really wanted this to be good. Cate Blanchett's androgynously husky voice rumbled through the darkness….\"ooooh, this is going to be good\" muttered my soul. And it was. From start to finish, I love this movie. Certainly it has its faults. I felt like Jackson, with all the money and technology at his disposal, still managed to make a scene or two here and there look like it was shot on a VHS camcorder. I'll never be completely happy with the casting. Some of the scenes that were cut from the book were my favorite (the Old Forest deletion is a crying shame) and that's unfortunate, but expected. All in all, my complaints are far outweighed by the laurels I could lay upon this…considering the grand scope, let's call it, this achievement.\n         ", "book": "The Fellowship of the Ring (The Lord of the Rings, #1)", "user": "Jason Koivu", "stars": "5", "date": "Jul 31, 14", "likes": "106"},
{"text": "\n           \n           I wasn't really \"cool\" back in high school. I never made out with girls under the bleachers, or smoked under the bleachers, or did any of the other things under the bleachers that - I am lead to believe - the popular kids did. Instead, I maintained a low profile and waited for the teenage years - that wilderness of strangled thinking - to end.In high school, as today, I harbored geekish obsessions, had a wandering imagination, and nurtured an appreciation for minutiate. In other words, I should have been J.R.R. Tolkien's core audience. For whatever reason - perhaps intuition that I didn't need to dig my social hole any deeper - I never read  when most people first come upon . Actually, I was barely cognizant of LOTR until college, when the movies were released. I absolutely loved Peter Jackson's film trilogy. During law school, I left a legal writing final halfway through in order to see  on opening day. Despite this, I never desired to read the source material. From talking to my friends, who were Tolkien enthusiasts (\"nerds\"), I assumed I wouldn't like the books. They seemed too talky, dense, and plodding. Finally, one fair summer night on my patio, my friend Jon and I were drinking beer and talking about  and how it was funny we could do this openly and still have significant others of the opposite sex. (I believe my wife was inside at the time, deciding what she would take in the divorce). Somehow, in a Miller Light and bratwurst haze, Jon got me to commit to giving LOTR a try. Then, I did a keg stand with Jon's homemade beer. This is how I read. Now, having finished , I have new appreciation for what Peter Jackson accomplished. Yeah, he made it into an action film, but that's the medium of film; there needs to be action. He did a fine job of taking Tolkien's essence and goosing it. (Sometimes he goosed the action too much, but we can discuss Legolas surfing on his shield at Helm's Deep another day). It was this love of the film that, interestingly, made me hesitant to read the books. Folks who love Tolkien love Tolkien with a vengeance. If it isn't obvious already, I don't have that underlying feeling. I understand, theoretically, Tolkien's achievement, but I'm not going to pretend to know all the references - religious, mythic, and linguistic - used as ingredients. What I do know is that, at its heart, LOTR is an archetypal hero's journey. It begins with an orphan of average abilities, who has a task thrust upon him. This forces the hero to leave home and enter the wider world. In the world he must pass tests, learn lessons, and eventually accomplish his task. Once that is done, the hero can return home; however, he is forever changed, and the home to which he returns is different.The hero in LOTR is Frodo Baggins, a hobbit. Now, a hobbit is - well, they're short, but they're not dwarves. That's the important thing to remember. Hobbits are like pot-smoking liberal arts majors. They like to hang around, eat, smoke, drink, and talk. Frodo's uncle, Bilbo, is a rare hobbit who has gone out and had adventures. He also has a magic ring, which he gives to Frodo. This ring...well it's evil. I could explain more, and Tolkien certainly does, but suffice it to say the ring is a Macguffin. It's like Marcellus Wallace's suitcase in : it drives the plot, and that's all you need to know. (This being Tolkien, though, you are certainly able to learn much, much, much more). Bilbo and Frodo's friend, the wizard Gandalf, tells Frodo that he must take the ring to the Cracks of Doom to destroy it, lest the Dark Shadow Sauron get his figurative hands upon it. With this, the journey starts. Frodo is joined by three other hobbits: Sam (the loyal one); Pippin (the scared one); and Merry (the one portrayed by 's Dominic Monaghan). After some brushes with the Nine Riders/the Nazgul/the Ring Wraiths (Tolkien has a very Russian way of making up a name, and then making up two or three or four synonyms, which makes things a little confusing), the hobbits meet up with Aragorn/Strider who leads them to Rivendell, where the elves live under Elrond. There is a counsel, the Fellowship is joined by Boromir (a man), Legolas (an elf) and Gimli (a dwarf). It all sounds like the set-up for a very complicated joke. But rest assured, the fate of Middle-Earth is at stake. (Though that does not stop the characters from stopping repeatedly for long meals; apparently, the Fellowship is comprised of foodies and gourmands). It's important to note what this book is not: it is not an action-packed adventure. Mostly, it is people walking through this make-believe world, talking about the past, and worrying about the future. There is a battle in the mountains of Moria that lasts for two pages; other than that, there are only scattered paragraphs when people are running, swords are unsheathed, and the stakes are raised. If swords and arrows are what you seek, just stick to the films. Moreover, you aren't going to find complex characterizations. The good guys are varing shades of good, and the bad guys are really bad. About the only conflicted characters are Boromir, who is conflicted for five sentences or so, and Gollum, the strung-out ring-addict. So what is the book? Well, it's a place you visit. Anyone who knows me knows that I am a Nyquill connoisseur (or addict, take your pick). I often need something to calm my overactive mind before I can get to sleep. Instead of the Quill, for the past weeks, I used . This is a compliment. Tolkien's world is so immersive, so fully realized - with its varied races, songs, languages, and lore - that whenever you open the covers it's a sublime escape. You are in an ancient land filled with a rich and ancient history, and a wonderfully described topography. Sure, the shadow of war hangs over Middle-Earth, but there is no tension. If you feel like Frodo is in mortal danger, and might not accomplish his task, you're probably six years old and having the story read aloud. Reading  was simply comforting. I wouldn't mind a kindly wizard giving me sage advice: And I also wouldn't mind going on a little hike through the forest, and maybe hanging out with some elves:Frodo's journey is secondary to Tolkien's creation of Middle-Earth. And the genius of Middle-Earth is that it goes beyond the pages. With its allusions to a long history filled with famous leaders and famous events and famous battles, your imagination is ignited. Upon finishing the first book, I saw how LOTR became a place of refuge for the outcasts and iconoclasts of our world. Like comic books, it is a place of escape, where the everyday order is turned upside down: the stakes are high, the heroes short, the beer is plentiful, and girls a distant afterthought. \n         ", "book": "The Fellowship of the Ring (The Lord of the Rings, #1)", "user": "Matt", "stars": "4", "date": "Jun 10, 10", "likes": "150"},
{"text": "\n           \n           ( Want to read the complete review? Visit the article in !)I'll admit this: the only reason why I read the LOTR Trilogy was because I was jealous. The year: 1972. It was a time of ridiculously insane fashion: hot pants, maxi-coats (and pads) and rough-woven cotton shirts, so scratchy they felt like the sartorial equivalent of surgical gauze with chunks of wood stuck between the weave. It was not for the faint-hearted.And of course, who was the most faint-hearted? Me. I was entering a new high school in a new town in a country I hadn't live in since I was eight. And since I didn't fit in (or so I thought) I was desperate for a new identity. Since my sister had squatter's rights on the cute/adorable/PYT persona, I was left with the one that I later discovered would make high school life a living hell: The Smart One.The only problem was, I wasn't that smart. Sure, I could work in references to Betty Friedan with only the vaguest notion about who she was, but when you're surrounded with a peer group who thinks the face of feminism is Marlo Thomas, it was easy, except for the one person who was the true intellectual: Colleen. Colleen represented everything I wasn't: a polite, wise-beyond-her-years semi-adolescent with perfect skin and hair, who sported a near genius-level intellect. Think of an Asian Susan Dey with actual musical talent and the potential to enter Berkeley at fifteen. And it didn't help to have a mother whose daily mantra was \"why can't you be like Colleen?\"So I was in love/hate over Colleen. If Colleen wore culottes, I wore culottes, only mine were eight sizes larger. If Colleen cut her bangs, so did I. The problem was, she had straight Japanese hair that tumbled dutifully back into place whenever she tossed her sylph-like neck. Me? Picture the hair of a young, chubby and half-Japanese Phyllis Diller but without the wigline.But the one thing that stood out most about Colleen was her and her equally intellectually superior friends' obsession with LOTR. She told me stories of their endless discussions of Middle Earth, Gandolf and the rest of the lot. Images of Colleen and her friends, looking semi-elvish, slipping from class to class, dodging dull students, dogged me in English class. They were ninth-grade gods. It wasn't until Colleen told me they left an inside joke about their instructor on the blackboard in *Elvish* in one of their gifted classes that I decided to take action: I got on my bike, went to the local K-Mart and bought the Trilogy. I started out strong: the hobbits I was comfortable with. Then came the Elves. Then the dwarfs, the Orcs, the whatevers. After the parade of names like Bombadil, Elendil, Everclear, I had the horrible realization that I was hopelessly lost. And it wasn't going to be easy to find my way back.But I was undeterred. I sloughed my way through , then  and . I played little tricks to keep me interested: pretending I was one of the plucky hobbits, fantasizing myself as an Elven goddess--anything to keep me reading. It must have worked because I finished the damned set. But my plan didn't work. I was still me: I couldn't muster witticisms about Boromir to clueless classmates. I was still plump and my hair was as unruly as ever. Worse, my mother not only kept comparing me to Colleen, she started pulling out photos to illustrate her point. I shoved the books on the top shelf and tried not to think about being a Smart Kid ever again.But it was too late. I knew enough to be dangerous. I realized that even if I didn't like the books, I was familiar enough to make knowing comments about them to the right (i.e., AP-bound) clique. So I was accepted. Kinda.I still have the books. They're still sitting on my bookshelf, surviving countless moves and weedings. Still can't remember who Arwen is, though. \n         ", "book": "The Fellowship of the Ring (The Lord of the Rings, #1)", "user": "Linda", "stars": "2", "date": "Mar 27, 11", "likes": "64"},
{"text": "\n           \n           Hello. You may remember me as the title character of the Lord of Rings. I go by a lot of names: Dark Lord of Mordor, Sorcerer, Red Eye, Dark Power, Lord of Barad-dûr, Ring-maker and Base Master of Treachery (I use that one in my band). I actually object to Tolkien's chosen name of Sauron, which I understand originates from an adjective that means \"foul, putrid\" in his crappy invented language. What can I say, the showers in Mordor are sketchy at best. On weekends, my poker buddies call me Sauron the Destroyer of Nacho Platters. Because Tolkien intentionally failed to give a proper description of me in his books, allow me to give you an idea. I have a bit of a dark look. My quest for world domination having been thwarted, I watch a lot of TV these days. My body is roughly equivalent to the \"The Situation\" on Jersey Shore. Oh, no I don't watch that, but the Witch-king of Angmar is obsessed. He won't shut up about Snowcone or some bimbo on that show. I'm missing a finger, which while preventing me from raining down carnage on Middle Earth, allows me to collect decent EI. Plus the best lawyer in Mordor got me covered under the dismemberment clause on my insurance, so I'm riding the double dip gravy train. Much has been written about my terrible Lidless Red Eye, blah blah blah. It freaked out that little twat Frodo pretty good. I'll have you know that conjunctivitis is no laughing matter. Having to keep it open 24/7 to look for hoodlums skulking around Mordor is murder on my hydration. The Nazgul have enough lift and aim to get up there to toss a bucket of Visine at it, but it's just temporary relief. Regardless, I'm still more of a looker than your precious King Elessar or Aragorn or whatever he's calling himself these days. He's never met a brooding look he didn't like. Buy a razor. Get a real job.Someone sent me Peter Jackson's movies in the mail. The package had no return address but it was postmarked \"Hobbiton\", where ever the hell that is. As I watch these movies over and over (I never even finished the books) I was reminded of all my mistakes...Perhaps a ring was not a good choice. Some buddies have suggested that maybe I shouldn't have tied all of my terrible powers to something as easy to misplace as the One Ring. In retrospect, I should have forged The One Gas Station Bathroom Key Chain of Power. It would have been a lot harder to tief. I even could have pimped it out by making it from an Ent branch or Saruman's foot, for all the good that old fart did me. Maybe a ring would have been just fine if it had been a toe ring. Then it wouldn't glow in the dark like a target for every freaking Man on the battlefield. I heard that the guy who beat me was named \"Isildur\"!!?? WTF. Maybe I could have worn tougher gloves, I don't know. Perhaps the door to the Fires of Mount Doom should have had a better lock. ADT could have hooked me up with motion detectors but I hear that even cats can set those off. They claim they can calibrate them but I'm not so sure. The Uruk-hai are always jumping up on the table, so they would set it off for sure. Maybe just the alarm that goes off if something hits the lava, like pool alarms for kid. Although I guess it would have been too late by then. \"My preccciioouussss!\". Learn some balance a-hole.Frodo. That little prick. I'd rather not discuss how my quest for utter dominion was defeated by something I could poop out unnoticed.I'm getting off track. I'm supposed to discuss the events of the first book, the Fellowship of the Ring. Good times! I was on a comeback! Then the withered up senior citizen Gandalf had to go to the library and do a little research and figure out that my Ring was not some cracker jack prize. My Ringwraiths tried to track down the Ring but apparently taking it away from children was too difficult. If I had put the Nazgûl on fell beasts rather than bloody horses from the start I might have tracked down Frodo (prick) and his three buddies in the bloody woods. Don't horses have a good sense of smell!? Anyways, the fell beasts would have at least avoided drowning in a river. Sweet Mary. Then those Elves suggest a damn \"fellowship\". Could you have come up with a lamer group name?? Why not call it the \"Loose Association of People Who Share Common Beliefs or Activities…of the Ring\". That Balrog almost did me the biggest favour, he was always one of my peeps. \"You shall not pass!!\" What a line Gandy! How cow. I heard that one took like 15 takes because Pippin kept making everyone laugh by adding in the word \"gas\". Fool of a Took!Anyways, by the end of the Fellowship of the Ring, I still had a fighting chance. Great book. Anyways, The Two Towers won't be as fun to review. Sh*t hits the fan. (A note from Sauron's agent: full credit for the idea of this review goes to Kemper and )\n         ", "book": "The Fellowship of the Ring (The Lord of the Rings, #1)", "user": "Kane", "stars": "5", "date": "Feb 07, 11", "likes": "160"},
{"text": "\n           \n            I suppose what I am about to type will be considered sacrilegious to some reading this review. However, I always believe in honesty in reviews, so here goes anyway :)As much as I love the story, I have to say that I liked the movie better than the book. *gasp* There’s the blasphemy for you. Hehehehe. There was just so much singing in the book. I wish I could have skimmed the singing passages, but I was listening to the audiobook which made skipping the songs difficult. Maybe I was clouded in my judgement by the audiobook narrator’s singing talent, but I grew very tired of it early on in the book. And yet, it continued… and continued… and continued.The LOTR movies that came out in the early part of the 21st century are some of my favorite movies. I was amazed by the cinematography, the story, the acting, and the music. The movies were something my husband and I could both enjoy together, and we have watched the movies numerous times over the last several years. Other than reading part of THE HOBBIT when I was a kid, I had never gotten around to reading the LOTR trilogy.After listening to my husband wax poetic about how much he loved to read the Lord of the Rings growing up, I made a decision that I wanted to read the books to see for myself how they compared to the movies. Now that I’ve read the first book, I understand some of the characters my husband said were missing from the movies (such as Tom Bombadil). In regards to singing, Bombadil is definitely one of the main culprits! I kind of see why they chose to cut him out of the movie. I mean, the movie was already going to be really long anyway, so it seemed like a logical cut to me. I definitely love the world that Tolkien built. I didn’t hate the book. I just found it to be a bit long-winded at times. SCANDAL! I know, I know. LOTR is a classic. I found myself saying things like: “Stop singing, Gimli and get on with the action!!!!”. As much as I love the plot, I shouldn’t be belittling the book’s prose. But, I can’t be the only one who feels that way. Well, maybe I am. I don’t care. :PI still plan to continue the trilogy in book form. I have a feeling there will be less singing in the next book, but I could be fooled. I almost expect the guards of Mordor to break out into song. EEK! That’s an image that might have me giggling in RETURN OF THE KING. Tap dancing/singing guards in a giant orc chorus-line. I need therapy… or more sleep.I suppose I now understand what compelled someone to make a musical version of LOTR. I had always wondered the motivation behind the musical in the UK, but they likely are trying to capture the spirit of the songs in the books.\n         ", "book": "The Fellowship of the Ring (The Lord of the Rings, #1)", "user": "FlibBityFLooB", "stars": "3", "date": "Feb 16, 10", "likes": "26"},
{"text": "\n           \n           Never have I been so sad to give a low rating to such a revered book. I'm so sorry. I can't tell you how sorry I am.Again, I'm so sorry, but I found this book unbelievably dull. I really am so, so sorry. I'm desperately sad about this. This series has been such a foundation for modern-day fantasy that I'm incredibly disappointed in myself for not liking this. I have always wanted to be a Tolkien fangirl. I've always wanted to learn Elvish and get completely offended à la  but I can't. I just can't. I want so desperately to love Tolkien, but it just ain't happening. I've been trying this book for 17 years. Tolkien and I have a sad history. I've always been a book lover, when I was young, I would persist through any book, no matter how trying. The Hobbit was the first book that made me fall asleep. It's memorable to me because that's the first time, and only the second time it's ever happened. The other book that made me fall asleep? You guessed it. . I tried  in 10th grade. I couldn't get past Bilbo's birthday party. I tried it again almost 10 years ago when I was stuck in bed for several days due to, oh, a giant surgical wound in my neck. My doctor said I had to stay in bed for a few days. So, I reasoned, what better way than to resume my attempt at reading one of the greatest literary classics of all time than whole having no other option?Audiobook it was! I didn't last past Tom Bombadil before I decided, fuck this, I'm going to head to the gym with a bloody bandage on my neck. True story. I got a lot of really weird looks. My doctor gave me a prescription for Vicodin because he was concerned the pain would be too much to bear. Apparently, I didn't even need the Vicodin because that pedophile Tom Bombadil put me right to sleep.Seriously, were it not for the fact that  It was so unbelievably dull. There were parts, that to a Tolkien amateur like me, didn't have a whit of relevance or anything interesting to add to the plot (). Seriously, what the fuck is up with the farmer and Tom Bombadil?The plot was all sorts of disjointed. Some parts just didn't make any sense.  In context, sometimes they don't really make any sense. All the poems and songs are in there to sound pretty, and frankly, they bored the fuck out of me.For instance, in the middle of a serious dinner party where the company is just trying to decide what to do about the ring (surely a simple task), all of a sudden little Frodo stands up and solemnly announces.I was like  Where did that come from? It makes absolutely no sense in the context of the scene. Oh, sure, it's an inside thing on how Aragorn was the secret king, but nobody knew that! Everyone, elf, hobbit, dwarf, (and me) would have thought he was completely high on some elven grass. I think he has been an inspiration to generations of writers, artists, hell, gamers. My beloved World of Warcraft game featured elves, pretty much every fantasy book we have these days have been inspired in one way or another by Tolkien. Again, he was an amazing linguist, his work developing the Elvish tongue, among others, as well as his efforts in developing the rich, fantastic history of the world within his books is not to be disregarded by any means.But again, he is a linguist. He is a scholar. He may be the most brilliant one of those in the world, an inspiration to generations, but for me, personally, his writing is not to my tastes.But damn, the movies were amazing!\n         ", "book": "The Fellowship of the Ring (The Lord of the Rings, #1)", "user": "Khanh (Clowns, Nightmares, and Bunnies)", "stars": "2", "date": "May 31, 15", "likes": "322"},
{"text": "\n           \n           Authors who inspire a movement are usually misunderstood, especially by those they have inspired, and Tolkien is no exception, but one of the biggest misconceptions about Tolkien is the idea that he is somehow an 'innovator of fantasy'. He did add a number of techniques to the repertoire of epic fantasy writers, and these have been dutifully followed by his many imitators, but for the most part, these techniques are little more than bad habits.Many have called Tolkien by such epithets as 'The Father of Fantasy', but anyone who makes this claim simply does not know of the depth and history of the fantasy genre. For those who are familiar with the great and influential fantastical authors, from  and  to  and  to  and , it is clear that, long before Tolkien, fantasy was already a complex, well-established, and even a respected literary genre. contains an invented world, a carefully-constructed (and well-researched) archaic language, a powerful and unearthly queen, and a central character who is conflicted and lost between the forces of nobility and darkness. Poul Anderson's , which came out the same year as The Fellowship of the Ring, has distant, haughty elves, deep-delving dwarves, a broken sword which must be reforged, an epic war between the armies of light and darkness, another central character trapped between those extremes, and an interweaving of Christian and Pagan worldviews.So, if these aspects are not unique to Tolkien, then what does set him apart? Though Dunsany, Eddison, and Anderson all present worlds where light and dark come into conflict, they present these conflicts with a subtle and often ironic touch, recognizing that morality is a dangerous thing to present in absolutes. Tolkien (or ), on the other hand, has no problem in depicting evil as evil, good as good, and the only place they meet is in the temptation of an honest heart, as in Gollum's case--and even then, he is not like Eddison's Lord Gro or Anderson's Scafloc, characters who live under an alternative view of the world, but instead fluctuates between the highs and lows of Tolkien's dualistic morality.It is a dangerous message to make evil an external, irrational thing, to define it as 'the unknown that opposes us', because it invites the reader to overlay their own morality upon the world, which is precisely what most modern fantasy authors tend to do, following Tolkien's example. Whether it's  or John Norman's , its very easy to simply create a magical allegory to make one side 'right' and the other side 'wrong', and you never have to develop a dramatic narrative that actually explores the soundness of those ideas. Make the good guys dress in bright robes or silvery maile and the bad guys in black, spiky armor, and a lot of people will never notice that all the 'good guys' are White, upper class men, while all the 'bad guys' are 'brutish foreigners', and that both sides are killing each other and trying to rule their little corner of the world.In Tolkien's case, his moral view was a very specific evocation of the ideal of , which is an attempt by certain stodgy old Tories (like Tolkien) to rewrite history so that the nobility were all good and righteous leaders, the farmers were all happy in their 'proper place' (working a simple patch of dirt), while both industrialized cultures and the 'primitives' who resided to the South and East were 'the enemy' bent on despoiling the 'natural beauty of England' (despite the fact that the isles had been flattened, deforested, and partitioned a thousand years before).Though Tom Bombadil remains as a strangely incoherent reminder of the moral and social complexity of the fantasy tradition upon which Tolkien draws, he did his best to scrub the rest clean, spending years of his life  more wholly into his Pagan adventure realm. But then, that's often how we think of Tolkien: bent over his desk, spending long hours researching, note-taking, compiling, and playing with language. Even those who admit that Tolkien demonstrates certain racist, sexist, and classicist leanings (as, indeed, do many great authors) still praise the complexity of his 'world building'.And any student of the great Epics, like the Norse Eddas, the Bible, or the Shahnameh can see what Tolkien is trying to achieve with his worldbuilding: those books presented grand stories, but were also about depicting a vast world of philosophy, history, myth, geography, morality and culture. They were encyclopedic texts, intended to instruct their people on everything important in life, and they are extraordinarily valuable to students of anthropology and history, because even the smallest detail can reveal something about the world which the book describes.So, Tolkien fills his books with troop movements, dull songs, lines of lineage, and references to his own made-up history, mythology, and language. He has numerous briefly-mentioned side characters and events because organic texts like the epics, which were formed slowly, over time and compiled from many sources often contained such digressions. He creates characters who have similar names--which is normally a stupid thing to do, as an author, because it is so confusing--but he’s trying to represent a hereditary tradition of prefixes and suffixes and shared names, which many great families of history had. So Tolkien certainly had a purpose in what he did, but was it a purpose that served the story he was trying to tell?Simply copying the form of reality is . Art is meaningful--it is directed. It is not just a list of details--everything within is carefully chosen by the author to make up a good story. The addition of detail is not the same as adding depth, especially since Tolkien’s world is not based on some outside system--it is whatever he says it is. It’s all arbitrary, which is why the only thing that grants a character, scene, or detail purpose is the meaning behind it. Without that meaning, then what Tolkien is doing is just a very elaborate thought exercise. Now, it’s certainly true that many people have been  with studying it, but that’s equally true of many thought exercises, such as the rules and background of the Pokemon card game, or crossword puzzles.Ostensibly, Scrabble supposedly is a game for people who love words--and yet, top Scrabble players sit an memorize lists of words whose meaning they will never learn. Likewise, many literary fandom games become little more than word searches: find this reference, connect that name to this character--but which have no meaning or purpose outside of that. The point of literary criticism is always to lead us back to human thought and ideas, to looking at how we think and express ourselves. If a detail in a work cannot lead us back to ourselves, then it is no more than an arbitrary piece of chaff.The popularity of Tolkien’s work made it acceptable for other authors to do the same thing, to the point that whenever I hear a book lauded for the ‘depth of its world building’, I expect to find a mess of obsessive detailing, of piling on so many inconsequential facts and figures that the characters and stories get buried under the scree, as if the author secretly hopes that by spending most of the chapter describing the hero’s cuirass, we'll forget that he’s a bland archetype who only succeeds through happy coincidence and  against an enemy with no internal structure or motivation.When Quiller-Couch said authors should ‘murder their darlings’, this is what he meant: just because you have hobbies and opinions does not mean you should fill your novel with them. Anything which does not materially contribute to the story, characters, and artistry of a work can safely be left out. Tolkien's embarrassment of detail also produced a huge inflation in the acceptable length of fantasy books, leading to the meandering, unending series that fill bookstore shelves today.Now, there are several notable critics who have lamented the unfortunate effect that Tolkien’s work has had on the genre, such as in Moorcock’s  and Mieville’s  about every modern fantasy author being forced to come to terms with the old don's influence. I agree with their deconstructions, but for me, Tolkien isn’t some special author, some ‘fantasy granddad’ looming over all. He’s just a bump in the road, one author amongst many in a genre that stretches back thousands of years into our very ideas of myth and identity, and not one of the more interesting onesHis ideas weren’t unique, and while his approach may have been unusual, it was only because he spent a lifetime trying obsessively to make something artificial seem more natural, despite the fact that the point of fantasy (and fiction in general) is to explore the artificial, the human side of the equation, to look at the world through the biased lens of our eye and to represent some odd facet of the human condition. Unfortunately, Tolkien’s characters, structure, and morality are all too flat to suggest much, no matter how many faux-organic details he surrounds them with.\n         ", "book": "The Fellowship of the Ring (Lord of the Rings, #1)", "user": "J.G. Keely", "stars": "3", "date": "Apr 08, 13", "likes": "220"}]